[
  {
    "id": 1,
    "title": "On the Nature of Creative Work [Placeholder]",
    "date": "November 28, 2024",
    "readTime": "2 Min",
    "wordCount": "100 Words",
    "tags": [
      "Creativity",
      "Process",
      "Reflection"
    ],
    "content": "Creative work demands a peculiar kind of attention—one that oscillates between focused execution and wandering curiosity. The best ideas often arrive in the margins, in those moments when we're not actively searching for them.\nI've noticed that my most productive creative sessions happen when I create the right conditions: sufficient time, minimal distractions, and a willingness to explore without immediate judgment. It's the difference between mining for specific gems and wandering through a landscape, open to whatever catches your eye.\nThe paradox of creative work is that it requires both discipline and freedom. Too much structure and you constrain possibility; too little and nothing materializes. Finding that balance is the ongoing work.\nWhat I've learned is to trust the process more. To sit with uncertainty. To allow ideas to emerge rather than forcing them into existence. The work unfolds in its own time, and our job is to show up consistently and pay attention."
  },
  {
    "id": 2,
    "title": "The years teach much which the days never know",
    "date": "November 14, 2025",
    "readTime": "2 Min",
    "wordCount": "120 Words",
    "tags": [
      "Life",
      "Reflection"
    ],
    "content": "Once Abraham Lincoln said, 'Give me six hours to chop down a tree and I will spend the first four sharpening the axe'.Often an underestimated statement. We human-beings are severely drowned in the ocean of instant gratification rather than focusing on the larger picture. This in turn leads to poor choices and eventually terrible outcomes. Taking instant gratification into account- many of us are often 'doom-scrolling' on social-media. Hours and hours go by simply scrolling. Additionally, scientist says that there has been we are dropping donwn on average attention span bar since "
  }
]